app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $productModel = new ProductModel();
        $orderModel = new OrderModel();
        $categoryModel = new CategoryModel();

        $blogModel = new BlogPostModel();
        $customRequestModel = new CustomRequestModel();

        $data['totalProducts'] = $productModel->where('status', 'active')->countAllResults();
        $data['totalOrders'] = $orderModel->countAll();
        $data['totalRevenue'] = $orderModel->selectSum('total')->where('status', 'completed')->get()->getRow()->total ?? 0;
        $data['totalCategories'] = $categoryModel->where('status', 'active')->countAllResults();
        $data['totalUsers'] = auth()->getProvider()->countAll();
        $data['totalBlogPosts'] = $blogModel->where('status', 'published')->countAllResults();
        $data['totalCustomRequests'] = $customRequestModel->countAllResults();
        $data['pendingCustomRequests'] = $customRequestModel->where('status', 'pending')->countAllResults();
        $data['recentBlogPosts'] = $blogModel->orderBy('id', 'DESC')->findAll(5);
---
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT SUM(`total`) AS `total`
FROM `orders`
WHERE `status` = 'completed'
SELECT COUNT(*) AS `numrows`
FROM `categories`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT *
FROM `orders`
ORDER BY `id` DESC
 LIMIT 5