app/Models/OrderModel.php

    public function getUserOrders($userId)
    {
        return $this->where('user_id', $userId)->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `orders`
WHERE `user_id` = 1
ORDER BY `id` DESC