app/Models/ProductModel.php

    public function getFeatured()
    {
        return $this->select('products.*, categories.name as category_name')
            ->join('categories', 'categories.id = products.category_id', 'left')
            ->where('products.status', 'active')
            ->where('products.is_featured', 1)
            ->orderBy('products.id', 'DESC')
            ->findAll(12);
---
SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`status` = 'active'
AND `products`.`is_featured` = 1
ORDER BY `products`.`id` DESC
 LIMIT 12

    public function getBySlug($slug)
    {
        return $this->select('products.*, categories.name as category_name, categories.slug as category_slug')
            ->join('categories', 'categories.id = products.category_id', 'left')
            ->where('products.slug', $slug)
            ->where('products.status', 'active')
            ->first();
---
SELECT `products`.*, `categories`.`name` as `category_name`, `categories`.`slug` as `category_slug`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`slug` = 'enchanted-forest'
AND `products`.`status` = 'active'
 LIMIT 1